{
  "backend/main.mo": "Minimal canister actor with no logic, serving as a placeholder for the deployed backend.",
  "feature_evidence.json": "Defines feature evidence reports linking user features to relevant frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains pregenerated summaries of various frontend files and assets for reference or tooling.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining steps and prerequisites for deploying the site as a permanent IC canister.",
  "frontend/index.css": "Tailwind-based global style layer defining color tokens and theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point with metadata, favicon links, and script loading the main React bundle.",
  "frontend/src/App.tsx": "Main React app rendering navigation, service sections, contact info, and share-link functionality with responsive layout.",
  "frontend/src/components/SafeImage.tsx": "Image component that handles loading errors with fallbacks or hidden rendering to prevent broken images.",
  "frontend/src/config/shareLink.ts": "Provides functions to build the public canister share URL and copy it to the clipboard.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor instance tied to the user's identity, with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hook managing auth state, login flow, identity persistence, and client configuration.",
  "frontend/src/index.css": "Alternative global stylesheet defining warm industrial-design color tokens and dark mode variants.",
  "frontend/src/main.tsx": "React entry point that initializes query client, wraps the app in Internet Identity provider, and mounts the UI.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, custom theme extensions, animations, and typography/container/animate plugins.",
  "project_state.json": "Defines the project’s deployment state, including permanent ICP hosting goals, known issues with draft canisters, and active feature requests."
}