{
  "backend/main.mo": "Motoko canister managing user profiles and an admin-controlled image gallery with upload, update, delete, and reorder operations secured by authorization checks.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend features, related files, components, and test mappings for the project.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose of each frontend file including components, hooks, assets, and configuration.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining how to build and deploy the project canister to the Internet Computer.",
  "frontend/index.css": "Tailwind CSS base file defining global styles and a warm industrial color palette for light and dark modes.",
  "frontend/index.html": "HTML entry point setting metadata, icons, and mounting the React application.",
  "frontend/src/App.tsx": "Main React application with navigation, gallery slider, service sections, admin entry, share link utilities, and Internet Computer data fetching.",
  "frontend/src/components/AdminGalleryPanel.tsx": "Admin UI enabling authenticated admins to upload, delete, and reorder gallery images with Internet Identity login and React Query actions.",
  "frontend/src/components/GallerySlider.tsx": "Image slider component with swipe, auto‑advance, navigation buttons, and metadata overlay.",
  "frontend/src/components/SafeImage.tsx": "Image wrapper that handles load errors, fallbacks, and optional hidden display on failure.",
  "frontend/src/config/shareLink.ts": "Builds a public canister share URL and provides a helper to copy it to the clipboard.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/logout handling, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for gallery image fetching and admin image operations using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and theme variables defining a warm industrial color palette with dark mode.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, including session-backed storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Defines project state, existing features, and pending requests for a homepage image slider and admin-only image management."
}