{
  "kind": "build_request",
  "title": "Use uploaded photos across the site and update the website icon (favicon)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Add the 12 uploaded images as optimized static assets and place them throughout the existing single-page site to make it more visually attractive (hero + relevant service sections), using responsive layouts (grid/cards) and ensuring images are cropped appropriately for mobile and desktop.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-19"
        ],
        "quotes": [
          "use these images to make the website more attractive"
        ]
      },
      "acceptanceCriteria": [
        "All 12 uploaded images are included in the built frontend as static assets (no backend/image fetching).",
        "Hero section includes at least one of the uploaded tractor/music visuals in a prominent way without harming text readability (e.g., overlay/gradient as needed).",
        "Each service section (Music Systems, Modification Materials, Electrical Mechanic Services) displays relevant uploaded imagery in a clean responsive layout (no broken aspect ratios, no overflow on mobile).",
        "All images include English alt text (generic descriptive alt text is OK).",
        "Page performance is maintained by using resized/optimized variants (no full-resolution originals used directly in main layout where unnecessary)."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Replace the website icon (favicon) with an enhanced version derived from the user-selected uploaded image (the Beniwal Music Center / Beniwal Music Stereo signboard image), and update the header/footer logo to match the new branding image where appropriate.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-19"
        ],
        "quotes": [
          "use this as website icon",
          "use this complete image as icon by some minor changes to make it attractive do it by yourself"
        ]
      },
      "acceptanceCriteria": [
        "The HTML head includes favicon links that load the new generated icon assets (e.g., 32x32 favicon + 180x180 apple-touch icon).",
        "Browser tab/favicon updates correctly after rebuild.",
        "Header and footer logo render crisply and consistently with the updated brand icon (no stretching; transparent background if applicable)."
      ]
    },
    {
      "id": "REQ-11",
      "text": "After the visual updates are complete, add a clear on-page prompt in the Contact section asking the site owner to provide contact information (phone number, address, and business hours) so the placeholders can be replaced later (English text).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-19"
        ],
        "quotes": [
          "and after completing this ask me for contact information"
        ]
      },
      "acceptanceCriteria": [
        "Contact section still shows placeholders for Phone/Address/Business Hours.",
        "A visible English note/callout in the Contact section asks the owner to provide phone, address, and business hours to update the site."
      ]
    }
  ],
  "constraints": [
    "Frontend must keep using static assets (do not route images through the backend).",
    "Do not edit files under frontend/src/components/ui or other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Keep the app as a single-page site with the existing sections and navigation; do not introduce checkout/e-commerce."
  ],
  "nonGoals": [
    "Adding a backend CMS/admin panel for editing contact info.",
    "Adding authentication or user accounts.",
    "Implementing image upload functionality inside the app (images are provided out-of-band)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Enhance and crop for a square brand icon with improved contrast/sharpness (WhatsApp Image 2026-02-06 at 2.51.23 AM (2).jpeg > bmc-icon.dim_512x512.png)",
      "Create favicon (WhatsApp Image 2026-02-06 at 2.51.23 AM (2).jpeg > favicon-32.dim_32x32.png)",
      "Create Apple touch icon (WhatsApp Image 2026-02-06 at 2.51.23 AM (2).jpeg > apple-touch-icon.dim_180x180.png)",
      "Create optimized hero background image (WhatsApp Image 2026-02-06 at 2.51.21 AM (2).jpeg > hero-photo.dim_1600x900.jpg)",
      "Create optimized section image (WhatsApp Image 2026-02-06 at 2.51.21 AM (1).jpeg > music-systems-photo.dim_1200x800.jpg)",
      "Create optimized section image (WhatsApp Image 2026-02-06 at 2.51.22 AM.jpeg > speaker-box-photo.dim_1200x800.jpg)",
      "Create optimized section image (WhatsApp Image 2026-02-06 at 2.51.23 AM (1).jpeg > lighting-shelf-photo.dim_1200x800.jpg)",
      "Create optimized section image (WhatsApp Image 2026-02-06 at 2.51.22 AM (1).jpeg > modification-parts-collage.dim_1200x800.jpg)",
      "Create optimized section image (WhatsApp Image 2026-02-06 at 2.51.23 AM.jpeg > exhaust-parts-photo.dim_1200x800.jpg)",
      "Create optimized section image (WhatsApp Image 2026-02-06 at 2.51.20 AM.jpeg > tractor-field-photo.dim_1200x800.jpg)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use uploaded images to enhance the site and set a custom favicon derived from the shop signboard image; keep user-facing text in English."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}