{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Homepage gallery slider and admin-only gallery management UI (Internet Identity)",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Add a responsive homepage gallery/slider that renders ordered images from the backend gallery list using SafeImage fallbacks.",
      "acceptanceCriteria": [
        "Homepage includes a dedicated gallery/slider section that displays all images from the backend list in order.",
        "The slider supports next/previous controls and swipe/drag on mobile.",
        "Images are responsive, do not cause layout shift, and handle load errors gracefully (e.g., hide broken items or show placeholder).",
        "If backend returns the default static-asset list, those images render correctly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useGalleryImages.ts",
          "operation": "create",
          "description": "Create a React Query hook that uses core-infrastructure actor access (via useActor) to fetch gallery images for display from the backend, returning loading/error states and an easy-to-consume array for UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/GallerySlider.tsx",
          "operation": "create",
          "description": "Create an attractive, responsive carousel/slider component that accepts gallery metadata and renders items using SafeImage with fixed aspect ratio/height to prevent layout shift; include next/prev controls plus mobile swipe/drag support; gracefully handle missing/broken images (hide item or show placeholder). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new homepage gallery/slider section into the existing single-page layout (add a dedicated section near the top of the homepage), fetching images via useGalleryImages and rendering them through GallerySlider; ensure any image URL derivation uses blob-storage ExternalBlob direct URLs when provided by backend. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add an admin-only gallery management panel (Internet Identity login) to upload, delete, and reorder homepage images; hide controls for non-admin users.",
      "acceptanceCriteria": [
        "Admin Panel includes an Internet Identity login action (using the existing Internet Identity provider/hooks) and shows the logged-in principal.",
        "If the logged-in principal is not the admin, the panel shows an access denied message and hides all mutation controls.",
        "Admin can upload an image (JPEG/PNG) and it appears in the homepage gallery after save.",
        "Admin can delete an image and it is removed from the homepage gallery.",
        "Admin can reorder images and the new order persists after page reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminGallery.ts",
          "operation": "create",
          "description": "Create a hook that wraps admin-oriented gallery operations using the authenticated actor from useActor: check isCallerAdmin/getCurrentAdmin, upload (JPEG/PNG) via blob-storage ExternalBlob, delete by id, and reorder by id list; include React Query cache invalidation for the public gallery query after mutations. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AdminGalleryPanel.tsx",
          "operation": "create",
          "description": "Create an English Admin Panel UI section that uses the authorization component’s Internet Identity flow (useInternetIdentity) to login/logout, displays the logged-in principal, checks admin status before showing controls, and provides: (1) upload form (file + optional title/description), (2) delete controls per image, (3) reorder UI (drag-and-drop or move up/down) with an explicit save action; handle backend authorization failures with clear messages. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a clearly labeled Admin entry point in the existing navigation (desktop + mobile) that scrolls to an Admin section; render the AdminGalleryPanel within that section and ensure non-admin users only see login/access-denied messaging (no mutation controls). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add the 7 user-provided images as static assets and ensure they are used as the initial/default gallery content without broken filename references.",
      "acceptanceCriteria": [
        "All 7 uploaded images are included in the frontend static assets under a consistent folder (e.g., frontend/public/assets/uploads/).",
        "The default gallery list references these 7 images so the homepage gallery is populated without requiring admin uploads.",
        "No hardcoded references remain to image filenames that do not exist in the repository."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/uploads/whatsapp-2026-02-06-02-51-20-am.jpeg",
          "operation": "create",
          "description": "Add the uploaded image file as a static asset (preserve original file as-is)."
        },
        {
          "path": "frontend/public/assets/uploads/whatsapp-2026-02-06-02-51-21-am-1.jpeg",
          "operation": "create",
          "description": "Add the uploaded image file as a static asset (preserve original file as-is)."
        },
        {
          "path": "frontend/public/assets/uploads/whatsapp-2026-02-06-02-51-21-am-2.jpeg",
          "operation": "create",
          "description": "Add the uploaded image file as a static asset (preserve original file as-is)."
        },
        {
          "path": "frontend/public/assets/uploads/whatsapp-2026-02-06-02-51-21-am.jpeg",
          "operation": "create",
          "description": "Add the uploaded image file as a static asset (preserve original file as-is)."
        },
        {
          "path": "frontend/public/assets/uploads/whatsapp-2026-02-06-02-51-22-am-1-1.jpeg",
          "operation": "create",
          "description": "Add the uploaded image file as a static asset (preserve original file as-is)."
        },
        {
          "path": "frontend/public/assets/uploads/whatsapp-2026-02-06-02-51-22-am-1.jpeg",
          "operation": "create",
          "description": "Add the uploaded image file as a static asset (preserve original file as-is)."
        },
        {
          "path": "frontend/public/assets/uploads/whatsapp-2026-02-06-02-51-22-am.jpeg",
          "operation": "create",
          "description": "Add the uploaded image file as a static asset (preserve original file as-is)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove/adjust any hardcoded gallery image references so the homepage gallery content is driven by the backend gallery list (which should provide the default static-asset paths when empty), ensuring no references point to missing filenames; keep existing non-gallery imagery (e.g., hero/banner) intact. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}